cassandra_docs/cassandrda_tests/cassandra-stress_read_duration=3m_-rate_threads=50.txt
******************** Stress Settings ********************
Command:
  Type: read
  Count: -1
  Duration: 3 MINUTES
  No Warmup: false
  Consistency Level: LOCAL_ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Distribution: Gaussian:  min=1,max=1000000,mean=500000.500000,stdev=166666.500000
  Order: ARBITRARY
  Wrap: false
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 5
  Column Names: [C0, C1, C2, C3, C4]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=5
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V4
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [localhost]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Pptions: {replication_factor=1}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  Thrift Port: 9160
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: READ
TokenRange:
  Wrap: false
  Split Factor: 1

Sleeping 2s...
Warming up READ with 50000 iterations...
Connected to cluster: Test Cluster, max pending requests per connection 128, max connections per host 8
Datatacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
Running READ with 50 threads 3 minutes
type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
total,          4078,    4078,    4078,    4078,     3.7,     2.5,    10.3,    25.5,    38.7,    43.6,    1.0,  0.00000,      0,      1,      21,      21,       0,     202
total,         19712,   15634,   15634,   15634,     3.2,     2.4,     7.3,    18.8,    29.4,    85.9,    2.0,  0.42489,      0,      2,      18,      35,       1,     405
total,         34076,   14364,   14364,   14364,     3.5,     2.4,    10.0,    25.2,    47.9,    55.2,    3.0,  0.26798,      0,      3,      25,      68,       2,     608
total,         50048,   15972,   15972,   15972,     3.1,     2.4,     7.1,    19.4,    27.1,    32.5,    4.0,  0.19762,      0,      3,      21,      55,       2,     607
total,         66692,   16644,   16644,   16644,     3.0,     2.4,     6.6,    14.0,    24.8,    28.0,    5.0,  0.15728,      0,      2,      19,      36,       1,     405
total,         82662,   15970,   15970,   15970,     3.1,     2.4,     6.8,    19.8,    40.2,    42.1,    6.0,  0.13007,      0,      3,      20,      56,       1,     608
total,         97857,   15195,   15195,   15195,     3.3,     2.3,     8.9,    21.7,    28.3,    46.9,    7.0,  0.11069,      0,      3,      19,      56,       0,     609
total,        114053,   16196,   16196,   16196,     3.1,     2.4,     6.9,    16.2,    28.3,    41.6,    8.0,  0.09662,      0,      2,      20,      39,       1,     405
total,        130001,   15948,   15948,   15948,     3.1,     2.5,     6.5,    17.5,    33.4,    43.6,    9.0,  0.08563,      0,      3,      28,      71,       3,     607
total,        145819,   15818,   15818,   15818,     3.1,     2.5,     6.7,    20.7,    28.7,    34.0,   10.0,  0.07682,      0,      3,      23,      66,       1,     607
total,        162492,   16673,   16673,   16673,     3.0,     2.4,     6.1,    11.3,    33.6,    39.3,   11.0,  0.06996,      0,      2,      28,      53,       2,     405
total,        178166,   15674,   15674,   15674,     3.2,     2.3,     7.4,    25.1,    36.1,    43.8,   12.0,  0.06399,      0,      3,      28,      76,       2,     608
total,        194865,   16699,   16699,   16699,     3.0,     2.4,     6.2,    11.3,    28.8,    35.0,   13.0,  0.05914,      0,      2,      23,      45,       1,     406
total,        210934,   16069,   16069,   16069,     3.1,     2.4,     6.4,    19.6,    38.2,    57.5,   14.0,  0.05491,      0,      3,      27,      73,       2,     607
total,        227411,   16477,   16477,   16477,     3.0,     2.4,     6.1,    14.3,    33.1,    37.9,   15.0,  0.05125,      0,      3,      28,      72,       3,     609
total,        244596,   17185,   17185,   17185,     2.9,     2.3,     6.1,    12.7,    26.5,    31.9,   16.0,  0.04822,      0,      2,      21,      40,       1,     404
total,        261594,   16998,   16998,   16998,     2.9,     2.4,     6.0,    16.8,    26.1,    38.1,   17.0,  0.04550,      0,      3,      19,      57,       0,     609
total,        278168,   16574,   16574,   16574,     2.9,     2.4,     6.2,    12.6,    29.7,    38.1,   18.0,  0.04298,      0,      3,      22,      61,       1,     608
total,        295126,   16958,   16958,   16958,     3.0,     2.3,     6.6,    20.1,    32.1,    46.4,   19.0,  0.04083,      0,      2,      23,      43,       2,     405
total,        311983,   16857,   16857,   16857,     2.9,     2.4,     6.0,    17.4,    31.1,    37.8,   20.0,  0.03882,      0,      3,      26,      67,       3,     607
total,        329102,   17119,   17119,   17119,     2.9,     2.3,     6.4,    14.2,    27.2,    32.9,   21.0,  0.03704,      0,      2,      21,      42,       0,     405
total,        346116,   17014,   17014,   17014,     2.9,     2.3,     6.1,    16.9,    28.2,    41.9,   22.0,  0.03542,      0,      3,      21,      62,       0,     610
total,        362534,   16418,   16418,   16418,     3.0,     2.4,     6.4,    20.8,    30.3,    47.8,   23.0,  0.03387,      0,      3,      25,      68,       2,     607
total,        379839,   17305,   17305,   17305,     2.9,     2.3,     6.3,    12.0,    31.0,    34.2,   24.0,  0.03254,      0,      2,      21,      42,       0,     405
total,        396558,   16719,   16719,   16719,     3.0,     2.3,     6.3,    16.3,    33.7,    41.9,   25.0,  0.03125,      0,      3,      21,      62,       0,     607
total,        412335,   15777,   15777,   15777,     3.1,     2.4,     7.7,    18.5,    26.9,    43.5,   26.0,  0.03005,      0,      2,      20,      40,       0,     405
total,        428942,   16607,   16607,   16607,     3.0,     2.3,     6.6,    19.6,    33.4,    61.2,   27.0,  0.02897,      0,      3,      28,      73,       3,     609
total,        446170,   17228,   17228,   17228,     2.9,     2.3,     6.4,    16.1,    26.6,    29.8,   28.0,  0.02797,      0,      3,      21,      61,       0,     608
total,        463914,   17744,   17744,   17744,     2.8,     2.3,     5.8,    11.0,    27.3,    37.0,   29.0,  0.02715,      0,      2,      21,      42,       0,     404
total,        477624,   13710,   13710,   13710,     3.6,     2.4,     8.6,    25.5,    88.1,    90.8,   30.0,  0.02652,      0,      3,      25,      67,       2,     609
total,        492787,   15163,   15163,   15163,     3.3,     2.5,     8.1,    20.4,    29.2,    47.9,   31.0,  0.02574,      0,      3,      51,      93,      14,     765
total,        509416,   16629,   16629,   16629,     3.0,     2.3,     6.4,    18.8,    31.0,    41.5,   32.0,  0.02494,      0,      3,      22,      63,       1,     607
total,        526963,   17547,   17547,   17547,     2.8,     2.3,     5.9,    12.8,    26.8,    28.4,   33.0,  0.02425,      0,      2,      22,      42,       1,     406
total,        543568,   16605,   16605,   16605,     3.0,     2.3,     6.3,    22.0,    35.9,    38.3,   34.0,  0.02354,      0,      3,      24,      64,       2,     608
total,        560427,   16859,   16859,   16859,     2.9,     2.3,     6.0,    11.3,    32.2,    44.3,   35.0,  0.02288,      0,      3,      26,      66,       3,     608
total,        578002,   17575,   17575,   17575,     2.9,     2.3,     6.0,    13.6,    27.2,    32.8,   36.0,  0.02232,      0,      2,      20,      40,       0,     405
total,        594852,   16850,   16850,   16850,     3.0,     2.4,     6.2,    16.0,    28.5,    34.3,   37.0,  0.02172,      0,      3,      22,      62,       1,     608
total,        611647,   16795,   16795,   16795,     2.9,     2.3,     6.7,    16.0,    25.8,    29.1,   38.0,  0.02114,      0,      3,      24,      65,       2,     607
total,        628904,   17257,   17257,   17257,     2.9,     2.3,     6.1,    15.5,    30.8,    37.0,   39.0,  0.02063,      0,      2,      20,      39,       1,     406
total,        645671,   16767,   16767,   16767,     3.0,     2.3,     6.8,    15.6,    33.3,    39.3,   40.0,  0.02012,      0,      3,      21,      61,       0,     607
total,        663059,   17388,   17388,   17388,     2.9,     2.3,     5.9,    10.8,    28.5,    40.2,   41.0,  0.01968,      0,      3,      24,      67,       1,     609
total,        680077,   17018,   17018,   17018,     2.9,     2.3,     6.2,    16.2,    29.1,    34.0,   42.0,  0.01922,      0,      2,      25,      45,       3,     404
total,        696997,   16920,   16920,   16920,     2.9,     2.3,     5.9,    14.3,    38.3,    54.3,   43.0,  0.01879,      0,      3,      23,      65,       1,     608
total,        714148,   17151,   17151,   17151,     2.9,     2.4,     6.0,    11.1,    26.1,    34.0,   44.0,  0.01838,      0,      2,      21,      41,       1,     405
total,        730669,   16521,   16521,   16521,     3.0,     2.3,     6.3,    19.5,    37.4,    41.9,   45.0,  0.01797,      0,      3,      24,      68,       1,     610
total,        747182,   16513,   16513,   16513,     3.0,     2.3,     6.4,    17.5,    34.1,    55.1,   46.0,  0.01758,      0,      3,      26,      70,       2,     607
total,        763978,   16796,   16796,   16796,     3.0,     2.3,     6.6,    13.2,    43.6,    49.8,   47.0,  0.01721,      0,      2,      31,      52,       5,     406
total,        780413,   16435,   16435,   16435,     3.0,     2.5,     5.9,    13.1,    31.7,    34.9,   48.0,  0.01685,      0,      3,      28,      68,       4,     608
total,        797806,   17393,   17393,   17393,     2.9,     2.3,     6.3,    12.5,    34.9,    50.5,   49.0,  0.01656,      0,      2,      21,      42,       0,     405
total,        814456,   16650,   16650,   16650,     3.0,     2.4,     6.4,    14.6,    28.2,    37.1,   50.0,  0.01622,      0,      3,      21,      62,       0,     607
total,        831022,   16566,   16566,   16566,     3.0,     2.4,     6.3,    15.4,    33.1,    38.5,   51.0,  0.01590,      0,      3,      24,      67,       1,     608
total,        848117,   17095,   17095,   17095,     2.9,     2.3,     6.3,    12.8,    27.6,    31.2,   52.0,  0.01560,      0,      2,      24,      46,       1,     406
total,        864792,   16675,   16675,   16675,     3.0,     2.4,     6.1,    19.5,    29.5,    41.9,   53.0,  0.01531,      0,      3,      23,      65,       1,     610
total,        881918,   17126,   17126,   17126,     2.9,     2.3,     6.1,    16.6,    27.7,    34.3,   54.0,  0.01503,      0,      3,      21,      63,       0,     607
total,        898937,   17019,   17019,   17019,     2.9,     2.4,     6.1,    11.6,    29.3,    36.2,   55.0,  0.01476,      0,      2,      21,      42,       0,     405
total,        915689,   16752,   16752,   16752,     3.0,     2.4,     6.1,    18.0,    33.5,    36.7,   56.0,  0.01450,      0,      3,      22,      64,       0,     609
total,        932759,   17070,   17070,   17070,     2.9,     2.2,     6.4,    17.1,    29.3,    37.8,   57.0,  0.01425,      0,      3,      25,      69,       2,     607
total,        949921,   17162,   17162,   17162,     2.9,     2.3,     6.3,    12.2,    33.9,    37.4,   58.0,  0.01401,      0,      2,      21,      42,       0,     406
total,        966801,   16880,   16880,   16880,     2.9,     2.3,     6.4,    14.9,    36.4,    44.5,   59.0,  0.01378,      0,      3,      24,      68,       1,     608
total,        983776,   16975,   16975,   16975,     2.9,     2.3,     6.3,    12.6,    26.9,    38.6,   60.0,  0.01355,      0,      3,      23,      65,       1,     609
total,       1000749,   16973,   16973,   16973,     3.0,     2.4,     6.2,    15.1,    30.0,    31.9,   61.0,  0.01333,      0,      2,      25,      46,       2,     405
total,       1017321,   16572,   16572,   16572,     3.0,     2.3,     6.5,    15.1,    33.8,    46.9,   62.0,  0.01312,      0,      3,      28,      70,       3,     607
total,       1034256,   16935,   16935,   16935,     2.9,     2.4,     5.9,    10.2,    29.7,    34.6,   63.0,  0.01291,      0,      2,      24,      46,       1,     406
total,       1050897,   16641,   16641,   16641,     3.0,     2.4,     6.1,    15.4,    29.3,    35.1,   64.0,  0.01271,      0,      3,      24,      65,       2,     608
total,       1067431,   16534,   16534,   16534,     3.0,     2.3,     6.5,    16.1,    35.4,    40.2,   65.0,  0.01251,      0,      3,      28,      74,       2,     608
total,       1084557,   17126,   17126,   17126,     2.9,     2.3,     6.4,    11.5,    31.3,    43.7,   66.0,  0.01233,      0,      2,      22,      44,       0,     406
total,       1101256,   16699,   16699,   16699,     3.0,     2.3,     6.2,    20.0,    33.2,    35.8,   67.0,  0.01215,      0,      3,      28,      73,       3,     608
total,       1118392,   17136,   17136,   17136,     2.9,     2.3,     6.1,    11.1,    29.0,    35.9,   68.0,  0.01197,      0,      2,      24,      46,       1,     406
total,       1135055,   16663,   16663,   16663,     3.0,     2.4,     6.2,    15.8,    32.7,    54.0,   69.0,  0.01180,      0,      3,      22,      64,       0,     607
total,       1151755,   16700,   16700,   16700,     3.0,     2.3,     6.5,    19.1,    29.9,    32.8,   70.0,  0.01163,      0,      3,      22,      64,       0,     608
total,       1169093,   17338,   17338,   17338,     2.9,     2.3,     6.2,    13.0,    29.7,    33.1,   71.0,  0.01148,      0,      2,      24,      45,       2,     406
total,       1185790,   16697,   16697,   16697,     3.0,     2.3,     6.5,    15.8,    34.5,    35.9,   72.0,  0.01132,      0,      3,      22,      65,       0,     608
total,       1201797,   16007,   16007,   16007,     3.1,     2.4,     6.6,    18.5,    35.0,    37.5,   73.0,  0.01118,      0,      3,      24,      67,       1,     608
total,       1218767,   16970,   16970,   16970,     2.9,     2.3,     6.3,    12.6,    34.9,    51.9,   74.0,  0.01103,      0,      2,      30,      53,       4,     406
total,       1235284,   16517,   16517,   16517,     3.0,     2.4,     6.3,    17.9,    28.8,    36.6,   75.0,  0.01089,      0,      3,      25,      68,       2,     607
total,       1252068,   16784,   16784,   16784,     3.0,     2.4,     6.3,    10.5,    28.4,    31.6,   76.0,  0.01074,      0,      2,      24,      46,       1,     405
total,       1268685,   16617,   16617,   16617,     3.0,     2.4,     6.3,    15.9,    29.2,    46.4,   77.0,  0.01060,      0,      3,      24,      67,       1,     608
total,       1285410,   16725,   16725,   16725,     3.0,     2.4,     6.0,    13.4,    28.6,    36.5,   78.0,  0.01047,      0,      3,      21,      63,       0,     609
total,       1302730,   17320,   17320,   17320,     2.9,     2.4,     5.8,    10.4,    27.0,    29.9,   79.0,  0.01034,      0,      2,      22,      43,       1,     405
total,       1319226,   16496,   16496,   16496,     3.0,     2.4,     6.5,    15.2,    29.6,    35.5,   80.0,  0.01021,      0,      3,      22,      64,       0,     607
total,       1335970,   16744,   16744,   16744,     2.9,     2.4,     6.0,    11.5,    28.9,    37.5,   81.0,  0.01009,      0,      3,      23,      67,       0,     608
total,       1352609,   16639,   16639,   16639,     3.0,     2.3,     6.9,    20.0,    29.6,    35.5,   82.0,  0.00996,      0,      2,      22,      44,       0,     405
total,       1368863,   16254,   16254,   16254,     3.1,     2.4,     6.4,    14.2,    32.8,    41.1,   83.0,  0.00985,      0,      3,      27,      71,       2,     609
total,       1385697,   16834,   16834,   16834,     3.0,     2.4,     6.2,    12.1,    30.3,    51.4,   84.0,  0.00973,      0,      2,      26,      47,       3,     404
total,       1402681,   16984,   16984,   16984,     2.9,     2.3,     6.1,    13.9,    28.1,    33.1,   85.0,  0.00962,      0,      3,      22,      65,       0,     609
total,       1419325,   16644,   16644,   16644,     3.0,     2.5,     6.0,    11.8,    27.4,    37.3,   86.0,  0.00951,      0,      3,      24,      66,       1,     607
total,       1435570,   16245,   16245,   16245,     3.1,     2.4,     6.8,    16.6,    29.6,    44.8,   87.0,  0.00940,      0,      2,      24,      46,       1,     405
total,       1452493,   16923,   16923,   16923,     2.9,     2.3,     6.3,    15.9,    27.3,    32.8,   88.0,  0.00929,      0,      3,      21,      63,       0,     609
total,       1469855,   17362,   17362,   17362,     2.9,     2.3,     6.2,    12.8,    26.5,    32.4,   89.0,  0.00920,      0,      2,      22,      43,       1,     405
total,       1486521,   16666,   16666,   16666,     3.0,     2.4,     6.1,    15.7,    32.0,    55.1,   90.0,  0.00910,      0,      3,      25,      66,       2,     608
total,       1503135,   16614,   16614,   16614,     3.0,     2.3,     6.2,    17.3,    32.5,    36.1,   91.0,  0.00900,      0,      3,      29,      72,       4,     609
total,       1520266,   17131,   17131,   17131,     2.9,     2.3,     6.3,    12.1,    30.9,    39.6,   92.0,  0.00890,      0,      2,      22,      44,       0,     405
total,       1536969,   16703,   16703,   16703,     3.0,     2.3,     6.6,    15.8,    29.6,    37.8,   93.0,  0.00881,      0,      3,      24,      66,       1,     608
total,       1554040,   17071,   17071,   17071,     2.9,     2.4,     6.2,    11.5,    28.5,    42.1,   94.0,  0.00872,      0,      3,      22,      65,       0,     608
total,       1570507,   16467,   16467,   16467,     3.0,     2.4,     6.4,    19.1,    27.7,    33.8,   95.0,  0.00863,      0,      2,      21,      42,       0,     405
total,       1587251,   16744,   16744,   16744,     3.0,     2.4,     6.2,    14.1,    29.0,    34.8,   96.0,  0.00854,      0,      3,      22,      64,       0,     607
total,       1604402,   17151,   17151,   17151,     2.9,     2.3,     6.2,    10.3,    31.8,    35.6,   97.0,  0.00845,      0,      2,      21,      42,       0,     405
total,       1621147,   16745,   16745,   16745,     3.0,     2.4,     6.4,    15.0,    30.7,    40.5,   98.0,  0.00837,      0,      3,      26,      69,       2,     609
total,       1638168,   17021,   17021,   17021,     2.9,     2.3,     6.2,    12.3,    29.2,    34.6,   99.0,  0.00828,      0,      3,      23,      65,       1,     607
total,       1655421,   17253,   17253,   17253,     2.9,     2.4,     6.0,    10.2,    28.0,    32.8,  100.0,  0.00821,      0,      2,      22,      43,       1,     405
total,       1672391,   16970,   16970,   16970,     2.9,     2.4,     6.0,    12.4,    26.4,    35.7,  101.0,  0.00812,      0,      3,      22,      63,       1,     609
total,       1689319,   16928,   16928,   16928,     2.9,     2.4,     6.0,    13.9,    27.0,    34.8,  102.0,  0.00805,      0,      3,      21,      62,       0,     607
total,       1706522,   17203,   17203,   17203,     2.9,     2.3,     6.1,    11.1,    31.1,    32.5,  103.0,  0.00797,      0,      2,      26,      48,       2,     406
total,       1723087,   16565,   16565,   16565,     3.0,     2.4,     6.3,    17.9,    28.2,    46.2,  104.0,  0.00789,      0,      3,      22,      64,       0,     607
total,       1740031,   16944,   16944,   16944,     2.9,     2.4,     6.0,    13.7,    27.8,    34.1,  105.0,  0.00782,      0,      3,      22,      64,       0,     609
total,       1756415,   16384,   16384,   16384,     3.0,     2.4,     6.8,    16.8,    28.9,    38.8,  106.0,  0.00775,      0,      2,      22,      43,       1,     405
total,       1772533,   16118,   16118,   16118,     3.0,     2.3,     6.8,    19.4,    36.2,    44.4,  107.0,  0.00768,      0,      3,      23,      65,       1,     607
total,       1784950,   12417,   12417,   12417,     3.9,     2.7,    11.0,    23.0,    75.2,    80.4,  108.0,  0.00788,      0,      2,      22,      43,       1,     405
total,       1798563,   13613,   13613,   13613,     3.7,     2.3,    11.4,    26.4,    44.9,    59.8,  109.0,  0.00796,      0,      3,      70,     114,      23,     687
total,       1815435,   16872,   16872,   16872,     3.0,     2.4,     6.1,    12.7,    31.0,    46.6,  110.0,  0.00789,      0,      2,      26,      46,       3,     406
total,       1832014,   16579,   16579,   16579,     3.0,     2.4,     6.5,    17.5,    28.2,    41.8,  111.0,  0.00782,      0,      3,      21,      60,       1,     608
total,       1849104,   17090,   17090,   17090,     2.9,     2.4,     6.2,    10.7,    27.5,    34.7,  112.0,  0.00775,      0,      3,      21,      61,       0,     608
total,       1865688,   16584,   16584,   16584,     3.0,     2.3,     6.6,    16.6,    29.5,    44.0,  113.0,  0.00768,      0,      2,      25,      45,       3,     406
total,       1882633,   16945,   16945,   16945,     2.9,     2.3,     6.2,    17.2,    30.9,    33.7,  114.0,  0.00761,      0,      3,      27,      69,       3,     608
total,       1899807,   17174,   17174,   17174,     2.9,     2.4,     6.0,    11.0,    31.7,    38.5,  115.0,  0.00755,      0,      2,      27,      52,       1,     405
total,       1913475,   13668,   13668,   13668,     3.6,     2.3,    11.3,    26.8,    39.0,    40.7,  116.0,  0.00764,      0,      3,      30,      74,       4,     609
total,       1929092,   15617,   15617,   15617,     3.2,     2.3,     8.3,    21.3,    43.1,    62.2,  117.0,  0.00758,      0,      2,      28,      48,       4,     405
total,       1945352,   16260,   16260,   16260,     3.0,     2.4,     6.5,    13.3,    32.5,    40.3,  118.0,  0.00752,      0,      3,      27,      73,       3,     608
total,       1960628,   15276,   15276,   15276,     3.3,     2.5,     8.2,    23.8,    34.1,    39.9,  119.0,  0.00749,      0,      2,      20,      40,       0,     405
total,       1977508,   16880,   16880,   16880,     2.9,     2.4,     5.9,    10.7,    26.1,    31.9,  120.0,  0.00743,      0,      3,      22,      63,       1,     610
total,       1994400,   16892,   16892,   16892,     3.0,     2.4,     6.3,    13.7,    28.6,    32.5,  121.0,  0.00737,      0,      2,      22,      43,       1,     405
total,       2010967,   16567,   16567,   16567,     3.0,     2.4,     6.3,    16.8,    28.1,    33.1,  122.0,  0.00731,      0,      3,      21,      62,       0,     607
total,       2027522,   16555,   16555,   16555,     3.0,     2.4,     6.5,    14.2,    30.2,    39.5,  123.0,  0.00725,      0,      2,      21,      42,       0,     405
total,       2044064,   16542,   16542,   16542,     3.0,     2.3,     6.5,    16.3,    35.0,    40.0,  124.0,  0.00719,      0,      3,      25,      68,       2,     610
total,       2060788,   16724,   16724,   16724,     2.9,     2.4,     6.0,    13.4,    32.7,    36.9,  125.0,  0.00713,      0,      3,      28,      72,       3,     608
total,       2077921,   17133,   17133,   17133,     3.0,     2.4,     6.1,    14.7,    28.2,    45.4,  126.0,  0.00708,      0,      2,      21,      42,       0,     406
total,       2094431,   16510,   16510,   16510,     3.0,     2.4,     6.4,    17.1,    30.9,    37.2,  127.0,  0.00702,      0,      3,      26,      70,       2,     608
total,       2111302,   16871,   16871,   16871,     2.9,     2.4,     6.2,    11.6,    27.6,    40.4,  128.0,  0.00697,      0,      2,      22,      43,       1,     404
total,       2127719,   16417,   16417,   16417,     3.0,     2.4,     6.2,    14.9,    29.6,    31.8,  129.0,  0.00692,      0,      3,      26,      67,       3,     608
total,       2144118,   16399,   16399,   16399,     3.0,     2.4,     6.4,    13.7,    33.8,    43.8,  130.0,  0.00686,      0,      3,      28,      72,       3,     608
total,       2160962,   16844,   16844,   16844,     3.0,     2.3,     6.6,    19.5,    39.1,    43.2,  131.0,  0.00681,      0,      2,      29,      55,       2,     406
total,       2177741,   16779,   16779,   16779,     3.0,     2.4,     6.5,    14.9,    26.9,    29.5,  132.0,  0.00676,      0,      3,      21,      62,       0,     608
total,       2194448,   16707,   16707,   16707,     3.0,     2.4,     6.5,    13.8,    32.4,    34.0,  133.0,  0.00671,      0,      2,      26,      50,       1,     406
total,       2210924,   16476,   16476,   16476,     3.0,     2.4,     6.4,    15.2,    27.6,    31.6,  134.0,  0.00666,      0,      3,      21,      61,       0,     609
total,       2227533,   16609,   16609,   16609,     3.0,     2.4,     6.2,    12.3,    28.6,    33.2,  135.0,  0.00661,      0,      3,      28,      69,       4,     608
total,       2244511,   16978,   16978,   16978,     3.0,     2.4,     6.2,    14.3,    32.3,    34.8,  136.0,  0.00656,      0,      2,      21,      41,       1,     405
total,       2260460,   15949,   15949,   15949,     3.1,     2.4,     7.0,    17.6,    29.5,    36.0,  137.0,  0.00652,      0,      3,      24,      66,       2,     609
total,       2277408,   16948,   16948,   16948,     2.9,     2.3,     6.4,    11.9,    26.7,    37.2,  138.0,  0.00648,      0,      2,      21,      42,       0,     406
total,       2293961,   16553,   16553,   16553,     3.0,     2.4,     6.5,    14.0,    30.6,    35.2,  139.0,  0.00643,      0,      3,      24,      70,       1,     608
total,       2310933,   16972,   16972,   16972,     2.9,     2.3,     6.6,    13.4,    29.7,    38.0,  140.0,  0.00639,      0,      3,      22,      64,       0,     608
total,       2327483,   16550,   16550,   16550,     3.0,     2.4,     6.1,    14.6,    32.1,    38.5,  141.0,  0.00634,      0,      2,      27,      48,       3,     404
total,       2344336,   16853,   16853,   16853,     2.9,     2.3,     6.3,    15.6,    27.4,    34.0,  142.0,  0.00630,      0,      3,      22,      63,       1,     610
total,       2361678,   17342,   17342,   17342,     2.9,     2.3,     6.3,    13.6,    26.7,    28.8,  143.0,  0.00626,      0,      2,      21,      42,       0,     405
total,       2378822,   17144,   17144,   17144,     2.9,     2.3,     6.0,    14.1,    29.1,    35.9,  144.0,  0.00622,      0,      3,      21,      61,       0,     607
total,       2395625,   16803,   16803,   16803,     3.0,     2.3,     6.6,    19.0,    28.4,    38.5,  145.0,  0.00617,      0,      3,      23,      65,       1,     609
total,       2412405,   16780,   16780,   16780,     3.0,     2.4,     6.4,    13.8,    31.8,    36.6,  146.0,  0.00613,      0,      2,      27,      48,       3,     406
total,       2428643,   16238,   16238,   16238,     3.1,     2.4,     6.5,    15.1,    30.7,    39.4,  147.0,  0.00609,      0,      3,      23,      66,       1,     608
total,       2445622,   16979,   16979,   16979,     2.9,     2.4,     6.1,    11.6,    30.7,    38.8,  148.0,  0.00605,      0,      3,      24,      66,       2,     607
total,       2462258,   16636,   16636,   16636,     3.0,     2.4,     6.3,    19.2,    29.7,    36.7,  149.0,  0.00601,      0,      2,      25,      46,       2,     405
total,       2478892,   16634,   16634,   16634,     3.0,     2.3,     6.6,    18.8,    29.9,    34.8,  150.0,  0.00597,      0,      3,      25,      67,       2,     609
total,       2495814,   16922,   16922,   16922,     2.9,     2.3,     6.3,    11.8,    29.2,    34.3,  151.0,  0.00593,      0,      2,      25,      45,       3,     405
total,       2512335,   16521,   16521,   16521,     3.0,     2.4,     6.4,    15.5,    29.1,    32.4,  152.0,  0.00589,      0,      3,      22,      63,       1,     608
total,       2529059,   16724,   16724,   16724,     2.9,     2.4,     6.1,    11.0,    26.4,    32.4,  153.0,  0.00586,      0,      3,      22,      63,       1,     609
total,       2545885,   16826,   16826,   16826,     3.0,     2.3,     6.5,    21.0,    34.1,    42.6,  154.0,  0.00582,      0,      2,      21,      42,       0,     406
total,       2562416,   16531,   16531,   16531,     3.0,     2.4,     6.3,    16.2,    35.3,    38.7,  155.0,  0.00578,      0,      3,      28,      73,       3,     608
total,       2579409,   16993,   16993,   16993,     2.9,     2.3,     6.3,    13.2,    31.8,    36.3,  156.0,  0.00574,      0,      2,      24,      45,       2,     405
total,       2595859,   16450,   16450,   16450,     3.0,     2.4,     6.1,    14.9,    32.1,    39.6,  157.0,  0.00571,      0,      3,      23,      66,       1,     609
total,       2612551,   16692,   16692,   16692,     2.9,     2.4,     6.1,    12.2,    27.3,    32.4,  158.0,  0.00567,      0,      3,      21,      63,       0,     607
total,       2629559,   17008,   17008,   17008,     3.0,     2.3,     6.5,    17.2,    29.5,    36.5,  159.0,  0.00564,      0,      2,      23,      44,       1,     405
total,       2646197,   16638,   16638,   16638,     3.0,     2.3,     6.6,    17.9,    32.8,    35.9,  160.0,  0.00560,      0,      3,      22,      63,       1,     609
total,       2663128,   16931,   16931,   16931,     2.9,     2.4,     6.2,    12.6,    26.4,    29.7,  161.0,  0.00557,      0,      2,      21,      42,       0,     405
total,       2679883,   16755,   16755,   16755,     3.0,     2.4,     6.2,    14.3,    27.6,    36.4,  162.0,  0.00553,      0,      3,      22,      64,       0,     607
total,       2696498,   16615,   16615,   16615,     3.0,     2.3,     6.5,    18.3,    28.0,    39.5,  163.0,  0.00550,      0,      3,      22,      64,       0,     609
total,       2713644,   17146,   17146,   17146,     2.9,     2.4,     6.2,    12.6,    29.3,    38.4,  164.0,  0.00547,      0,      2,      24,      44,       2,     405
total,       2730284,   16640,   16640,   16640,     3.0,     2.3,     6.7,    19.1,    36.6,    58.1,  165.0,  0.00544,      0,      3,      23,      66,       1,     608
total,       2747218,   16934,   16934,   16934,     2.9,     2.4,     6.3,    10.8,    30.9,    41.4,  166.0,  0.00541,      0,      2,      23,      46,       0,     404
total,       2763767,   16549,   16549,   16549,     3.0,     2.3,     6.8,    19.0,    28.2,    35.3,  167.0,  0.00537,      0,      3,      21,      62,       0,     609
total,       2780331,   16564,   16564,   16564,     3.0,     2.4,     6.4,    15.8,    26.3,    29.8,  168.0,  0.00534,      0,      3,      21,      63,       0,     607
total,       2797338,   17007,   17007,   17007,     2.9,     2.3,     6.5,    11.8,    28.6,    35.4,  169.0,  0.00531,      0,      2,      21,      42,       0,     405
total,       2813731,   16393,   16393,   16393,     3.0,     2.4,     6.4,    16.2,    27.2,    32.6,  170.0,  0.00528,      0,      3,      21,      62,       0,     609
total,       2830633,   16902,   16902,   16902,     2.9,     2.4,     6.3,    12.6,    32.8,    36.7,  171.0,  0.00525,      0,      2,      22,      43,       1,     404
total,       2847590,   16957,   16957,   16957,     2.9,     2.3,     6.4,    20.6,    28.2,    34.7,  172.0,  0.00522,      0,      3,      22,      63,       1,     609
total,       2863830,   16240,   16240,   16240,     3.1,     2.3,     6.7,    21.6,    35.9,    60.4,  173.0,  0.00519,      0,      3,      31,      72,       5,     608
total,       2880842,   17012,   17012,   17012,     2.9,     2.4,     6.1,    11.1,    26.7,    35.6,  174.0,  0.00516,      0,      2,      21,      42,       0,     406
total,       2897288,   16446,   16446,   16446,     3.0,     2.4,     6.3,    18.0,    30.3,    41.0,  175.0,  0.00513,      0,      3,      22,      64,       0,     607
total,       2914173,   16885,   16885,   16885,     2.9,     2.3,     6.6,    13.9,    34.0,    43.4,  176.0,  0.00511,      0,      2,      28,      50,       3,     406
total,       2930500,   16327,   16327,   16327,     3.0,     2.4,     6.4,    16.5,    28.5,    39.3,  177.0,  0.00508,      0,      3,      21,      63,       0,     609
total,       2947296,   16796,   16796,   16796,     3.0,     2.4,     6.0,    14.4,    30.9,    38.6,  178.0,  0.00505,      0,      3,      22,      64,       0,     607
total,       2964134,   16838,   16838,   16838,     3.0,     2.4,     6.0,    11.4,    27.6,    37.1,  179.0,  0.00502,      0,      2,      21,      41,       1,     405
total,       2980869,   16735,   16735,   16735,     3.0,     2.3,     6.3,    17.4,    32.0,    35.8,  180.0,  0.00499,      0,      3,      26,      73,       2,     608
total,       2992414,   16920,   16920,   16920,     2.9,     2.4,     6.0,    11.9,    28.1,    38.7,  180.7,  0.00497,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :   16,562 op/s  [READ: 16,562 op/s]
Partition rate            :   16,562 pk/s  [READ: 16,562 pk/s]
Row rate                  :   16,562 row/s [READ: 16,562 row/s]
Latency mean              :    3.0 ms [READ: 3.0 ms]
Latency median            :    2.4 ms [READ: 2.4 ms]
Latency 95th percentile   :    6.4 ms [READ: 6.4 ms]
Latency 99th percentile   :   15.2 ms [READ: 15.2 ms]
Latency 99.9th percentile :   31.4 ms [READ: 31.4 ms]
Latency max               :   90.8 ms [READ: 90.8 ms]
Total partitions          :  2,992,414 [READ: 2,992,414]
Total errors              :          0 [READ: 0]
Total GC count            : 469
Total GC memory           : 93.065 GiB
Total GC time             :   10.4 seconds
Avg GC time               :   22.1 ms
StdDev GC time            :    3.4 ms
Total operation time      : 00:03:00

END